<template>
    <v-container>
        <v-row :class="[ width > 1280 ? 'text_style' : 'text_style_mobile' ]" :style="textStyle" no-gutters justify="center">
            <v-col v-if="width > 1280"></v-col>
            <v-col :cols="[ width > 1280 ? 8 : 12 ]">
                &nbsp;&nbsp;&nbsp;&nbsp;Мурманская область – относительно молодой регион, однако сегодня является флагманом развития Арктики. <br>
                &nbsp;&nbsp;&nbsp;&nbsp;Арктическая зона Российской Федерации – крупнейший в мире незамерзающий порт за Северным полярным кругом и транспортный узел у северных берегов нашей страны.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;Здесь ускоренными темпами ведется строительство морского терминала «Тулома», порта «Лавна», железнодорожных и автомобильных мостов, современных скоростных дорог и развязок.<br> 
                &nbsp;&nbsp;&nbsp;&nbsp;В городах и поселках нашего региона становится всё более привлекательно и комфортно жить. Открываются новые детские сады, больницы, школы. Учреждения образования оснащены на высоком уровне: от системы охраны до компьютерной и интерактивной техники. В школах реализуются новые современные программы, передовые технологии, приветствуются творческий подход и новаторство в профессии.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;В жизни северян в приоритете спорт и здоровье: востребована и развита сеть горнолыжных, легкоатлетических комплексов, бассейнов и фитнесс-центров, ледовых арен, стадионов, спортивных школ и клубов.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;Стремительно преобразовывается сфера культуры и искусства. Полностью реконструированы и представлены в новом современном виде областной драматический театр, театр кукол, филармония, библиотеки, музеи, дома культуры и концертные площадки области.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;Для проведения досуга и семейного отдыха жителей и гостей региона ждут многочисленные турбазы, кинотеатры, кафе и рестораны, парковые зоны с фонтанами и детскими площадками.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;Активно развивается туристическая отрасль. Одна из изюминок нашего туризма – арктическая кухня с невероятно вкусными морепродуктами. Все туристы стремятся увидеть Териберку на берегу Северного Ледовитого океана.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;За последние годы решена проблема транспортной доступности в любую точку области, радуют обновленные железнодорожный вокзал с фирменными поездами, международный аэропорт федерального значения с возможностью прямых перелетов.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;Что и говорить, столица Арктики – сегодня одна из самых привлекательных для инвесторов территорий.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;А ещё это край с душой, где дыхание природы рядом! Когда красота окружающего мира тебя вдохновляет! И она всегда разная! То зимняя сказка со снежными сопками и северным сиянием в небе. То лето – в облаках цветущей сирени и морошковым ароматом в лесу, когда солнце забывает прятаться за горизонт. Осень в золоте лесов и весна со свежим ветром перемен, похожая на наш Кольский край.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;И именно в этих северных широтах живут самые отзывчивые и доброжелательные люди, готовые всегда помочь и поддержать.<br>
                &nbsp;&nbsp;&nbsp;&nbsp;Именно здесь ты не только начнёшь свой путь в профессии, но и станешь жителем перспективного региона с ярким будущим, найдёшь преданных друзей и обязательно влюбишься в природу нашего края!

            </v-col>
            <v-col v-if="width > 1280"></v-col>
        </v-row>
    </v-container>
</template>

<script>
import { inject } from 'vue'

export default{
    props: {
        // textContent: String,
        textStyle: Object
    },

    setup(){
        const width = inject('width');
        const height = inject('height');
        

        return { width, height }
    }
}
</script>

<style>
    .text_style{
        font-family: "MontserratMedium";
        font-size: 18px;
        line-height: 2;
        text-align: justify;
    }

    .text_style_mobile{
        font-family: "MontserratMedium";
        font-size: 16px;
        line-height: 2;
        text-align: justify;
    }

</style>