<template>
    <v-container>
        <v-row :class="[ width > 1280 ? 'text_style' : 'text_style_mobile' ]" :style="textStyle" no-gutters justify="center">
            <v-col v-if="width > 1280"></v-col>
            <v-col :cols="[ width > 1280 ? 8 : 12 ]">
                <p>Мурманская область, относительно молодой регион, сегодня является   флагманом развития Арктики с крупнейшим в мире незамерзающим портом за полярным кругом и главным транспортным узлом у северных берегов нашей страны.</p>
                <p>В регионе сегодня реализуется ряд ключевых проектов, в том числе строительство морского терминала «Тулома» и порта «Лавна», а также ведется масштабная работа по созданию комфортной городской среды, модернизации учреждений образования, культуры и спортивных объектов в рамках реализации федеральных программ и регионального плана «На Севере – жить!». Только в 2022-2023 годах открыты три новых детских сада и школа, начаты работ по строительству еще двух учреждений образования, завершены капитальные ремонты сразу на четырех объектах. В регионе модернизированы более 200 кабинетов, спортивных залов, столовых и общественных пространств в школах и садах, в том числе созданы отлично оснащенные площадки для углубленного изучения предметов и подготовки к олимпиадам.</p>
                <p>В Мурманской области каждый второй житель регулярно занимается спортом и физической культурой. Этому способствует планомерная работа регионального правительства: за последние 4 года созданы и модернизированы более 60 спортивных объектов, в том числе крупные физкультурно-оздоровительные комплексы. В их числе – ФОК «Вертикаль» с одним из лучших скалодромов в СЗФО и современная инфраструктура Кировской спортивной школы олимпийского резерва с горнолыжным подъемником длиной 780 метров, системами оснежения и освещения. Кстати, покататься на горных лыжах или сноуборде в течение самого продолжительного в стране сезона можно не только в Кировске, обустроенные склоны есть в Мурманске, Мончегорске и Ковдоре. Также в разных муниципалитетах открыты лыжные трассы и катки, а с 2022 года открываются современные молодежные пространства «СОПКИ.СПОРТ», в которых северяне до 35 лет могут заниматься бесплатно. В 2023 году число залов достигнет 17.</p>
                <p>Регион является пионером национального проекта «Культура»: в Мурманске открыта первая в стране библиотека, модернизированная по модельному стандарту, а также впервые проведена капитальная реновация объекта культуры в рамках одноименной федеральной инициативы. В заполярной столице работают три профессиональных театра, в том числе старейший за полярным кругом – областной театр кукол. А всего в регионе 13 областных музеев, филармония, 138 общедоступных библиотек, 24 из которых модельные, 50 детских школ искусств, музыкальных и художественных школ.</p>
                <p>В рамках регионального стратегического плана «На Севере – жить» в Мурманской области реализуется комплекс программ, направленных на повышение качества жизни северян. Так, «Свой дом в Арктике» - возможность получить выплату до 1,5 млн рублей на строительство, приобретение дома на первичном рынке или приобретение домокомплекта. С 5 июля 2022 года сертификаты уже получили более 600 северян общей суммой 813,7 млн рублей.</p>
                <p>Активно развивается туристическая отрасль. Одна из изюминок нашего туризма – арктическая кухня с невероятно вкусными морепродуктами. Все туристы стремятся увидеть Териберку, полуостров Рыбачий, старинные Варзугу и Умбу, удивительные Лапландский заповедник и заповедник Пасквик</p>
                <p>За последние годы решена проблема транспортной доступности в любую точку области, радуют обновленные железнодорожный вокзал и фирменные поезда, международный аэропорт федерального значения и возможность прямых перелетов.</p>
                <p>Что и говорить, столица Арктики – сегодня одна из самых привлекательных для инвесторов территорий.</p>
                <p>А еще это край с душой, где дыхание природы рядом! Когда красота окружающего мира тебя вдохновляет!  И она всегда разная! То зимняя сказка со снежными сопками и северным сиянием в небе. То лето - в облаках цветущей сирени и морошковым ароматом в лесу, когда солнце забывает прятаться за горизонт. Осень в золоте лесов, или весна со свежим ветром перемен, похожая на наш Кольский край.</p>
                <p>И именно в этих северных широтах живут самые отзывчивые и доброжелательные люди, готовые всегда помочь и поддержать.</p>
                <p>Именно здесь, ты не только начнешь свой путь в профессии, но и станешь жителем перспективного региона с ярким будущим, найдешь преданных друзей и обязательно влюбишься в удивительное Кольское Заполярье!</p>
            </v-col>
            <v-col v-if="width > 1280"></v-col>
        </v-row>
    </v-container>
</template>

<script>
import { inject } from 'vue'

export default{
    props: {
        // textContent: String,
        textStyle: Object
    },

    setup(){
        const width = inject('width');
        const height = inject('height');
        

        return { width, height }
    }
}
</script>

<style scoped>
    .text_style{
        font-family: "MontserratMedium";
        font-size: 18px;
        line-height: 1.7;
        text-align: justify;
        text-indent: 30px;
    }

    .text_style_mobile{
        font-family: "MontserratMedium";
        font-size: 16px;
        line-height: 1.5;
        text-align: justify;
        text-indent: 30px;
    }

</style>