[
 
 {
        "label": "Профессиональный горизонты",
        "color": "white",
        "img": "https://cs7.pikabu.ru/post_img/big/2019/01/08/11/1546973399180544975.jpg",
        "date": "21.10.2023",
        "description": "Задача организации, в особенности же рамки и место обучения кадров позволяет выполнять важные задания по разработке форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности требуют от нас анализа форм развития.",
        "id": 1,
        "page": 1
    },
    {
        "label": "ОБУЧЕНИЕ – НА РЕЗУЛЬТАТ",
        "color": "white",
        "img":  "https://www.mvestnik.ru/images/cms/thumbs/c6c8df74a7ee69a5bd57925e8331adadea700d58/noch_750_auto_jpg_5_70.jpg",
        "date": "07.10.2023",
        "description": "Равным образом рамки и место обучения кадров требуют определения и уточнения модели развития. Задача организации, в особенности же укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий позволяет выполнять важные задания по разработке соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции требуют определения и уточнения форм развития. Не следует, однако забывать, что консультация с широким активом в значительной степени обуславливает создание систем массового участия.",
        "id": 2,
        "page": 1
    },
    {
        "label": "Текст-рыба",
        "color": "white",
        "img": "https://c8.staticflickr.com/8/7362/27769687251_9f2e6f129f_o.jpg",
        "date": "22.10.2023",
        "description": "С другой стороны новая модель организационной деятельности играет важную роль в формировании дальнейших направлений развития. С другой стороны реализация намеченных плановых заданий в значительной степени обуславливает создание существенных финансовых и административных условий. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности требуют определения и уточнения новых предложений. Товарищи! рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации.",
        "id": 3,
        "page": 1
    },
    {
        "label": "О сайте",
        "color": "white",
        "img": "https://murmansk.travel/storage/images/medium.2b231c3292cb4407400e6393fbd764f6.png",
        "date": "01.10.2023",
        "description": "Таким образом консультация с широким активом влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании форм развития.",
        "id": 4,
        "page": 2
    },
    {
        "label": "Разнообразный и богатый опыт",
        "color": "white",
        "img": "https://cdn.fishki.net/upload/post/201601/10/1806723/2548887.jpg",
        "date": "30.10.2023",
        "description": "С другой стороны укрепление и развитие структуры требуют определения и уточнения модели развития. Товарищи! укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий. Повседневная практика показывает, что реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Идейные соображения высшего порядка, а также сложившаяся структура организации требуют от нас анализа системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям.",
        "id": 5,
        "page": 2
    },
    {
        "label": "Информационно-пропагандистское обеспечение",
        "color": "white",
        "img": "https://load-strapi-uploads.hb.bizmrg.com/obl_belye_nochi_9b7987544a.jpg",
        "date": "17.10.2023",
        "description": "Повседневная практика показывает, что консультация с широким активом позволяет оценить значение модели развития. Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности требуют определения и уточнения форм развития. Равным образом постоянный количественный рост и сфера нашей активности требуют от нас анализа соответствующий условий активизации. Равным образом начало повседневной работы по формированию позиции играет важную роль в формировании существенных финансовых и административных условий.",
        "id": 6,
        "page": 2
    },
    {
        "label": "Задача организации",
        "color": "white",
        "img": "https://aif-s3.aif.ru/images/020/013/30fb80623409243159180633f39e77f2.jpg",
        "date": "08.10.2023",
        "description": "Не следует, однако забывать, что консультация с широким активом в значительной степени обуславливает создание дальнейших направлений развития. Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития.",
        "id": 7,
        "page": 3
    }

]